Tekla Open API Reference for Tekla Structures 2025
PluginSymbolVisiblityAttribute Properties
The PluginSymbolVisiblityAttribute type exposes the following members.
Properties
Name | Description
Type
 Returns the type of the input object dependency.
Top
See Also
Reference
PluginSymbolVisiblityAttribute Class
Tekla.Structures.Plugins Namespace